GHB2/src/Documents/гхб_РаспределениеДоступовВПомещения/гхб_РаспределениеДоступовВПомещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гхб_РаспределениеДоступовВПомещения</name>
  <registerRecords>InformationRegister.гхб_РаспределениеДоступовВПомещения</registerRecords>
  <registerRecords>InformationRegister.гхб_РаспределениеДоступовВПомещенияЮридическиеЛица</registerRecords>
  <tabularSections>
    <name>Помещения</name>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЮридическоеЛицоСобственник</name>
      <type>
        <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
      </type>
    </attributes>
    <attributes>
      <name>ЮридическоеЛицоРаспорядитель</name>
      <type>
        <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
      </type>
    </attributes>
    <attributes>
      <name>ДивизионРаспорядитель</name>
      <type>
        <types>CatalogRef.гхб_Дивизионы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДепартаментРаспорядитель</name>
      <type>
        <types>CatalogRef.гхб_ПодразделенияОрганизацийБазХолдинга</types>
      </type>
    </attributes>
    <attributes>
      <name>ЮридическиеЛицаВПомещении</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДивизионыВПомещении</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДепартаментыВПомещении</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЮридическиеЛицаВПомещениях</name>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЮридическоеЛицо</name>
      <type>
        <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
      </type>
    </attributes>
    <attributes>
      <name>Дивизион</name>
      <type>
        <types>CatalogRef.гхб_Дивизионы</types>
      </type>
    </attributes>
    <attributes>
      <name>Департамент</name>
      <type>
        <types>CatalogRef.гхб_ПодразделенияОрганизацийБазХолдинга</types>
      </type>
    </attributes>
    <attributes>
      <name>Площадь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Закрыть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуществующийДоступ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УточняющаяИнформация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

GHB2/src/InformationRegisters/гхб_РаспределениеДоступовВПомещения/гхб_РаспределениеДоступовВПомещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_РаспределениеДоступовВПомещения</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ЮридическоеЛицоСобственник</name>
    <type>
      <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеЛицоРаспорядитель</name>
    <type>
      <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ДивизионРаспорядитель</name>
    <type>
      <types>CatalogRef.гхб_Дивизионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДепартаментРаспорядитель</name>
    <type>
      <types>CatalogRef.гхб_ПодразделенияОрганизацийБазХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическиеЛицаВПомещении</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДивизионыВПомещении</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДепартаментыВПомещении</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_РаспределениеДоступовВПомещенияЮридическиеЛица/гхб_РаспределениеДоступовВПомещенияЮридическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_РаспределениеДоступовВПомещенияЮридическиеЛица</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Площадь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Закрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УточняющаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЮридическоеЛицо</name>
    <type>
      <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дивизион</name>
    <type>
      <types>CatalogRef.гхб_Дивизионы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Департамент</name>
    <type>
      <types>CatalogRef.гхб_ПодразделенияОрганизацийБазХолдинга</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/Enums/гхб_ТипыСобытийОбъектовБД/гхб_ТипыСобытийОбъектовБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гхб_ТипыСобытийОбъектовБД</name>
  <enumValues>
    <name>ПервоеПроведениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>ПересчетПлощадиПомещений</name>
  </enumValues>
  <enumValues>
    <name>ПланируемаяБлокировкаПользователя</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеПриПроведении</name>
  </enumValues>
  <enumValues>
    <name>РассылкаПоСтатусамКонсервацииПомещений</name>
  </enumValues>
</mdclass:Enum>

GHB2/src/Documents/гхб_РаспределениеДоступовВПомещения/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ РегистрыСведений.гхб_СобытияОбъектовБД.СобытиеПоОбъектуБыло(Ссылка, Перечисления.гхб_ТипыСобытийОбъектовБД.ПервоеПроведениеДокумента) Тогда
		
		ДвиженияПоПомещения();
		ДвиженияПоЮридическиеЛицаВПомещениях();
		
		РегистрыСведений.гхб_СобытияОбъектовБД.ЗаписатьДанныеСобытияОбъекта(Ссылка, Перечисления.гхб_ТипыСобытийОбъектовБД.ПервоеПроведениеДокумента);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
         Возврат;
    КонецЕсли;
	
	Если (РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) 
	   И РегистрыСведений.гхб_СобытияОбъектовБД.СобытиеПоОбъектуБыло(Ссылка, Перечисления.гхб_ТипыСобытийОбъектовБД.ПервоеПроведениеДокумента) Тогда
	   
	   	Отказ = Истина;
		
	Иначе
		
		УдалитьСтрокиТЧСНеправильнымиПомещениями(ЮридическиеЛицаВПомещениях);
		
		Для Каждого Стр Из Помещения Цикл
			Стр.ЮридическиеЛицаВПомещении = "";
			Стр.ДивизионыВПомещении = "";
			Стр.ДепартаментыВПомещении = "";
		КонецЦикла;
		
		ЗаполнитьСокращенныеДанные(ЮридическиеЛицаВПомещениях, "ЮридическиеЛицаВПомещении", "ЮридическоеЛицо");
		ЗаполнитьСокращенныеДанные(ЮридическиеЛицаВПомещениях, "ДивизионыВПомещении", "Дивизион");
		ЗаполнитьСокращенныеДанные(ЮридическиеЛицаВПомещениях, "ДепартаментыВПомещении", "Департамент");
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(гхб_Ответственный) Тогда
		гхб_Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	гхб_Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДвиженияПоПомещения()
	
	Для Каждого Стр Из Помещения Цикл
		
		_Строка = Движения.гхб_РаспределениеДоступовВПомещения.Добавить();
		_Строка.Период = Дата;
		_Строка.Регистратор = Ссылка;
		_Строка.Помещение = Стр.Помещение;
		_Строка.ДепартаментРаспорядитель = Стр.ДепартаментРаспорядитель;
		_Строка.ДепартаментыВПомещении = Стр.ДепартаментыВПомещении;
		_Строка.ДивизионРаспорядитель = Стр.ДивизионРаспорядитель;
		_Строка.ДивизионыВПомещении = Стр.ДивизионыВПомещении;
		_Строка.ЮридическоеЛицоРаспорядитель = Стр.ЮридическоеЛицоРаспорядитель;
		_Строка.ЮридическоеЛицоСобственник = Стр.ЮридическоеЛицоСобственник;
		_Строка.ЮридическиеЛицаВПомещении = Стр.ЮридическиеЛицаВПомещении;
		
	КонецЦикла;
	
	Движения.гхб_РаспределениеДоступовВПомещения.Записать();
	
КонецПроцедуры

Процедура ДвиженияПоЮридическиеЛицаВПомещениях()
	
	Для Каждого Стр Из ЮридическиеЛицаВПомещениях Цикл
		
		Если (Стр.СуществующийДоступ И Стр.Закрыть) ИЛИ (НЕ Стр.СуществующийДоступ И НЕ Стр.Закрыть) Тогда
			
			_Строка = Движения.гхб_РаспределениеДоступовВПомещенияЮридическиеЛица.Добавить();
			_Строка.Период = Дата;
			_Строка.Регистратор = Ссылка;
			_Строка.Помещение = Стр.Помещение;
			_Строка.ЮридическоеЛицо = Стр.ЮридическоеЛицо;
			_Строка.Дивизион = Стр.Дивизион;
			_Строка.Департамент = Стр.Департамент;
			_Строка.Площадь = Стр.Площадь;
			_Строка.УточняющаяИнформация = Стр.УточняющаяИнформация;
			_Строка.Закрыть = Стр.Закрыть;
			
		КонецЕсли;
			
	КонецЦикла;
	
	Движения.гхб_РаспределениеДоступовВПомещенияЮридическиеЛица.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьСокращенныеДанные(_ТЧ, _ИмяПоляПриемника, _ИмяПоляИсточника)
	
	Для Каждого Стр Из _ТЧ Цикл
		_НС = Помещения.Найти(Стр.Помещение, "Помещение");
		
		Если НЕ (_НС = Неопределено) Тогда
			_НС[_ИмяПоляПриемника] = _НС[_ИмяПоляПриемника] + ?(ЗначениеЗаполнено(_НС[_ИмяПоляПриемника]), "; ", "") +
				СокрЛП(Стр[_ИмяПоляИсточника]);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьСтрокиТЧСНеправильнымиПомещениями(_ТЧ)
	
	ф = _ТЧ.Количество() - 1;
	
	Пока ф >= 0 Цикл
		
		Если Помещения.Найти(_ТЧ.Получить(ф).Помещение, "Помещение") = Неопределено Тогда
			_ТЧ.Удалить(ф);
		КонецЕсли;
		
		ф = ф - 1;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
